Library/app/controllers/sessions_controller.rb

  def create
    auth_hash = request.env['omniauth.auth']
    if session[:user_id]
      # Means our user is signed in. Add the authorization to the user
      User.find(session[:user_id]).add_provider(auth_hash)
      render :text => "You can now login using #{auth_hash['provider'].capitalize} too!"
    else
      # Log him in or sign him up
      auth = Authorization.find_or_create(auth_hash)
---
SELECT "users".* FROM "users" WHERE "users"."provider" = 'facebook' AND "users"."uid" = '100000113083429' LIMIT 1
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 18 Nov 2012 23:14:26 UTC +00:00], ["provider", "facebook"], ["uid", "1805970805"], ["updated_at", Sun, 18 Nov 2012 23:14:26 UTC +00:00], ["user_id", 3]]